app/controllers/boards_controller.rb

SELECT * FROM "boards"
---
  def index
    @boards = Board.all

SELECT * FROM "topics" WHERE (board_id = '1') ORDER BY created_at DESC LIMIT 20 OFFSET 0
---
  def show

    begin
      @board = Board.find_by_url_title(params[:id])
    rescue
      render "public/404.html", :status => :not_found
    end

    @topics = Topic.paginate :conditions => ["board_id = ?", "#{@board[:id]}"], :order => "created_at DESC", :page => params[:page]