app/controllers/search_controller.rb

SELECT * FROM "topics" WHERE (topics.id in ('4','5')) ORDER BY created_at DESC LIMIT 1 OFFSET 0
SELECT * FROM "posts" WHERE (posts.id in ('18','19')) ORDER BY created_at DESC LIMIT 10 OFFSET 0
---
  def results

      if params[:q].empty?
        flash[:error] = 'Please enter a search term.'
        redirect_to :controller => 'Search', :action => :index
        return
      end

      if request.post?
        redirect_to :controller => 'Search', :action => :results, :q => params[:q]
      end

      @topics = Topic.find_with_ferret( params[:q], { :per_page => TOPICS_PER_PAGE, :page => params[:page] }, { :order => 'created_at DESC' } )
      @posts = Post.find_with_ferret( params[:q], { :per_page => POSTS_PER_PAGE, :page => params[:page] }, { :order => 'created_at DESC' } )