app/controllers/sessions_controller.rb

  def register

    @title = 'Register'

    if request.post?

      @user = User.new(params[:user])

      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "workflow_state", "password_hash", "email") VALUES('2010-04-03 17:40:00', '2010-04-03 17:40:00', 'James', 'pending', 'd4270e8ea68fc3ac1c49d59d8602d7be1f86bb4d', 'james.f.inman@gmail.com')

  def password

    if request.post?

      if user = User.find_by_email( params[:user][:email] )

        new_password = Digest::SHA1.hexdigest( Time.now.to_s )[0,14]

        user.password = new_password
        user.save
---
SELECT "users".id FROM "users" WHERE (LOWER("users"."email") = 'james.f.inman@gmail.com' AND "users".id <> 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-04-03 14:05:51', "password_hash" = 'f7a9a4aa3a32ee3c78b162476a94198a6deea86d' WHERE "id" = 1