app/controllers/topics_controller.rb

  def create

    @topic = Topic.create(params[:topic])
---
INSERT INTO "topics" ("board_id", "created_at", "title", "first_post_id", "updated_at", "views", "user_id") VALUES(NULL, '2010-04-03 15:40:55', 'This is a test topic.', 22, '2010-04-03 15:40:55', 0, 1)

  def new
    @topic = Topic.new
    @boards = Board.all
---
SELECT * FROM "boards"

  def show

    begin
      @topic = Topic.find_by_url_title(params[:id])
    rescue
      render "public/404.html", :status => :not_found
    end

    @posts = @topic.posts.paginate :order => "created_at ASC", :page => params[:page]
---
SELECT * FROM "posts" WHERE ("posts".topic_id = 1) ORDER BY created_at ASC LIMIT 20 OFFSET 0
SELECT * FROM "topics" ORDER BY title ASC LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "posts" WHERE ("posts".topic_id = 1)

  def reply

    @post = Post.create(params[:post])
    @post.topic_id = params[:id]
    @post.user = current_user
    @post.save
---
INSERT INTO "posts" ("created_at", "updated_at", "user_id", "content", "topic_id") VALUES('2010-04-02 23:20:31', '2010-04-02 23:20:31', NULL, 'This is a reply.', NULL)
UPDATE "posts" SET "updated_at" = '2010-04-02 23:21:53', "topic_id" = 1, "user_id" = 1 WHERE "id" = 4