app/controllers/users_controller.rb

SELECT * FROM "users" WHERE (username LIKE 'B%') ORDER BY username ASC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "users" WHERE (username LIKE 'J%')
---
  def search

    if params[:terms].nil?
      redirect_to users_url
      return
    end

    @title = "Members Search: #{params[:terms]}"
    @letter = "#{params[:terms]}";
    @users = User.paginate :conditions => ["username LIKE ?", "#{@letter}%"], :order => "username ASC", :page => params[:page]

SELECT * FROM "users" WHERE ("users"."username" = 'James') LIMIT 1
SELECT * FROM "users" ORDER BY username ASC LIMIT 30 OFFSET 0
SELECT DISTINCT(id), title, created_at FROM "topics" WHERE ("topics".user_id = 2) ORDER BY created_at DESC LIMIT 5
SELECT DISTINCT(id), created_at FROM "posts" WHERE ("posts".user_id = 2) ORDER BY created_at DESC LIMIT 5
---
  def show

    @user = User.find_by_username(params[:id])
    @title = "#{params[:id]}'s Profile"

    unless @user
      render "public/404.html"
      return
    end

    @topics = @user.topics.all( :select => "DISTINCT(id), *", :order => "created_at DESC", :limit => 5 )
    @posts = @user.posts.all( :order => "created_at DESC", :limit => 5, :group => "topic_id" )

UPDATE "users" SET "updated_at" = '2010-04-03 14:06:14', "password_hash" = 'd4270e8ea68fc3ac1c49d59d8602d7be1f86bb4d' WHERE "id" = 1
---
  def update_password

    return unless request.post?

    @user = current_user

    if @user.update_attributes(params[:user])